Pandas nos sirve para poder leer y crear archivos de excel, utilizando data frames y series de pandas

In [53]:
import pandas as pd

In [54]:
lista = [1,2,3,4,6]
lista

[1, 2, 3, 4, 6]

In [55]:
lista2d = [
    [1,2,3],
    [1,2,3],
    [2,3,4]
]

In [56]:
lista2d

[[1, 2, 3], [1, 2, 3], [2, 3, 4]]

In [57]:
lista2d[2][1]

3

In [58]:
df = pd.DataFrame(lista2d, columns=['Alemania','Belgica', 'Canada'], index=[1110, 300, 2500])
# df = pd.DataFrame(lista2d, columns=['Alemania','Belgica', 'Canada'])
df

      Alemania  Belgica  Canada
1110         1        2       3
300          1        2       3
2500         2        3       4

In [59]:
df.sort_index(ascending=False)

      Alemania  Belgica  Canada
2500         2        3       4
1110         1        2       3
300          1        2       3

In [60]:
df.drop(columns=['Alemania'])

      Belgica  Canada
1110        2       3
300         2       3
2500        3       4

In [61]:
df

      Alemania  Belgica  Canada
1110         1        2       3
300          1        2       3
2500         2        3       4

In [62]:
type(df)

pandas.core.frame.DataFrame

In [63]:
df['Alemania']

1110    1
300     1
2500    2
Name: Alemania, dtype: int64

In [64]:
type(df['Alemania'])

pandas.core.series.Series

In [66]:
df['Alemania'] >= 2

1110    False
300     False
2500     True
Name: Alemania, dtype: bool

In [67]:
df['Alemania']

1110    1
300     1
2500    2
Name: Alemania, dtype: int64

In [71]:
df.loc[df['Alemania'] == 1]['Alemania']

1110    1
300     1
Name: Alemania, dtype: int64